#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.domain_sinsky_cc.cloudflare_dns_record.records["app"] will be created
  + resource "cloudflare_dns_record" "records" {
      + comment             = "App server by Tailscale"
      + comment_modified_on = (known after apply)
      + content             = "100.109.137.3"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "app"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = "aa67e2b9359ea75feb9419c7942857cd"
    }

  # module.domain_sinsky_cc.cloudflare_dns_record.records["dmarc"] will be created
  + resource "cloudflare_dns_record" "records" {
      + comment             = "ProtonMail DMARC"
      + comment_modified_on = (known after apply)
      + content             = "\"v=DMARC1; p=quarantine\""
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "_dmarc"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 3600
      + type                = "TXT"
      + zone_id             = "aa67e2b9359ea75feb9419c7942857cd"
    }

  # module.domain_sinsky_cc.cloudflare_dns_record.records["domainkey-1"] will be created
  + resource "cloudflare_dns_record" "records" {
      + comment             = "ProtonMail DomainKey"
      + comment_modified_on = (known after apply)
      + content             = "protonmail.domainkey.dglyzoia2xlbrc5ilrzvzetedbj4x4dgkstnc7ewxloqohjpupf7a.domains.proton.ch"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "protonmail._domainkey"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 3600
      + type                = "CNAME"
      + zone_id             = "aa67e2b9359ea75feb9419c7942857cd"
    }

  # module.domain_sinsky_cc.cloudflare_dns_record.records["domainkey-2"] will be created
  + resource "cloudflare_dns_record" "records" {
      + comment             = "ProtonMail DomainKey"
      + comment_modified_on = (known after apply)
      + content             = "protonmail2.domainkey.dglyzoia2xlbrc5ilrzvzetedbj4x4dgkstnc7ewxloqohjpupf7a.domains.proton.ch"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "protonmail2._domainkey"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 3600
      + type                = "CNAME"
      + zone_id             = "aa67e2b9359ea75feb9419c7942857cd"
    }

  # module.domain_sinsky_cc.cloudflare_dns_record.records["domainkey-3"] will be created
  + resource "cloudflare_dns_record" "records" {
      + comment             = "ProtonMail DomainKey"
      + comment_modified_on = (known after apply)
      + content             = "protonmail3.domainkey.dglyzoia2xlbrc5ilrzvzetedbj4x4dgkstnc7ewxloqohjpupf7a.domains.proton.ch"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "protonmail3._domainkey"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 3600
      + type                = "CNAME"
      + zone_id             = "aa67e2b9359ea75feb9419c7942857cd"
    }

  # module.domain_sinsky_cc.cloudflare_dns_record.records["gitea"] will be created
  + resource "cloudflare_dns_record" "records" {
      + comment             = "Gitea by Cloudflare Tunnel"
      + comment_modified_on = (known after apply)
      + content             = "d0f2f49b-7159-43b7-86ee-233223334c67.cfargotunnel.com"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "testea"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "aa67e2b9359ea75feb9419c7942857cd"
    }

  # module.domain_sinsky_cc.cloudflare_dns_record.records["mx-1"] will be created
  + resource "cloudflare_dns_record" "records" {
      + comment             = "ProtonMail MX"
      + comment_modified_on = (known after apply)
      + content             = "mail.protonmail.ch"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "@"
      + priority            = 10
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 3600
      + type                = "MX"
      + zone_id             = "aa67e2b9359ea75feb9419c7942857cd"
    }

  # module.domain_sinsky_cc.cloudflare_dns_record.records["mx-2"] will be created
  + resource "cloudflare_dns_record" "records" {
      + comment             = "ProtonMail MX"
      + comment_modified_on = (known after apply)
      + content             = "mailsec.protonmail.ch"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "@"
      + priority            = 20
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 3600
      + type                = "MX"
      + zone_id             = "aa67e2b9359ea75feb9419c7942857cd"
    }

  # module.domain_sinsky_cc.cloudflare_dns_record.records["note"] will be created
  + resource "cloudflare_dns_record" "records" {
      + comment             = "Note by Cloudflare Tunnel"
      + comment_modified_on = (known after apply)
      + content             = "d0f2f49b-7159-43b7-86ee-233223334c67.cfargotunnel.com"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "secure-note"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "aa67e2b9359ea75feb9419c7942857cd"
    }

  # module.domain_sinsky_cc.cloudflare_dns_record.records["spf"] will be created
  + resource "cloudflare_dns_record" "records" {
      + comment             = "ProtonMail SPF"
      + comment_modified_on = (known after apply)
      + content             = "\"v=spf1 include:_spf.protonmail.ch ~all\""
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "@"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 3600
      + type                = "TXT"
      + zone_id             = "aa67e2b9359ea75feb9419c7942857cd"
    }

  # module.domain_sinsky_cc.cloudflare_dns_record.records["ts"] will be created
  + resource "cloudflare_dns_record" "records" {
      + comment             = "Raspberry Pi by Tailscale server"
      + comment_modified_on = (known after apply)
      + content             = "100.68.0.72"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "ts"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = "aa67e2b9359ea75feb9419c7942857cd"
    }

  # module.domain_sinsky_cc.cloudflare_dns_record.records["verification"] will be created
  + resource "cloudflare_dns_record" "records" {
      + comment             = "ProtonMail verification"
      + comment_modified_on = (known after apply)
      + content             = "\"protonmail-verification=6ab8511f92d0a0626de1c959ad72fa8d45e6743b\""
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "@"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 3600
      + type                = "TXT"
      + zone_id             = "aa67e2b9359ea75feb9419c7942857cd"
    }

  # module.domain_sinsky_cc.cloudflare_dns_record.records["wildcard-app"] will be created
  + resource "cloudflare_dns_record" "records" {
      + comment             = "App server by Tailscale"
      + comment_modified_on = (known after apply)
      + content             = "100.109.137.3"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "*.app"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = "aa67e2b9359ea75feb9419c7942857cd"
    }

  # module.domain_sinsky_cc.cloudflare_dns_record.records["wildcard-ts"] will be created
  + resource "cloudflare_dns_record" "records" {
      + comment             = "Raspberry Pi by Tailscale server"
      + comment_modified_on = (known after apply)
      + content             = "100.68.0.72"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "*.ts"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = "aa67e2b9359ea75feb9419c7942857cd"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @sinsky, Action: `pull_request`, Workflow: `Terraform Validation`*